tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "weaveworks/tap"
tap "FelixKratz/formulae"


# dev
brew "xz"
brew "fd"
brew "neovim"
brew "tmux"
brew "tldr"
brew "ripgrep"
brew "awscli"
brew "kubernetes-cli"
brew "kubectx"
brew "weaveworks/tap/eksctl"
brew "helm"
brew "minikube"
brew "terraform"
brew "pyenv"
brew "go"
brew "node"
brew "pnpm"
brew "delve"
brew "poetry"
brew "pre-commit"
brew "gh"
brew "zig"
brew "arduino-cli"
brew "pipx"
cask "docker"
cask "font-hack-nerd-font"

# terminal & utilities
brew "coreutils"
brew "fzf"
brew "jq"
brew "pget"
brew "sd"
brew "dust"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "FelixKratz/formulae/borders"
cask "clipy"
cask "obsidian"
cask "slack"
cask "spotify"
cask "todoist"
cask "zoom"
cask "discord"
cask "raycast"
cask "zen-browser"
cask "ghostty"

# 3d printing
brew install --cask orcaslicer
