tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "weaveworks/tap"

# dev & cloud
brew "awscli"
brew "kubernetes-cli"
brew "kubectx"
brew "weaveworks/tap/eksctl"
brew "helm"
brew "minikube"
brew "terraform"
brew "pipenv"
brew "pyenv"
brew "go"
brew "vite"
brew "node"
brew "pnpm"
cask "docker"

# neovim
brew "xz"
brew "fd"
brew "neovim"
brew "tmux"
brew "ripgrep"
cask "font-hack-nerd-font"
cask "arc"

# terminal & utilities
brew "coreutils"
brew "fzf"
brew "jq"
brew "pget"
brew "sd"
brew "dust"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alfred"
cask "karabiner-elements"
cask "clipy"
cask "obsidian"
cask "slack"
cask "spotify"
cask "todoist"
cask "whatsapp"
cask "zoom"
cask "alacritty"
cask "discord"

# 3d printing
brew install --cask superslicer
